In [2]:
from pyproj import Proj, transform
import numpy as np
import pandas  as pd

# Projection 정의
# UTM-K
proj_UTMK = Proj(init='epsg:5181') # UTM-K(Bassel) 도로명주소 지도 사용 중

# WGS1984
# proj_WGS84 = Proj(init='epsg:4326') # Wgs84 경도/위도, GPS사용 전지구 좌표
proj_WGS84 = Proj(init='epsg:4326') # Wgs84 경도/위도, GPS사용 전지구 좌표

# 좌표 변환 Example

In [3]:
# UTM-K -> WGS84 샘플
x1, y1 = 185658.40757,447839.99221
x2, y2 = transform(proj_UTMK,proj_WGS84,x1,y1)
print(x2,y2)

126.837746714377 37.5299448479299

In [17]:
df = pd.read_csv('D:\data_little2.csv')
df

,r_code,r_name,r_kind,r_img,des,서울특별시 강남구 신사동 657-38번지,address-road,Latitude,longitude
0,1,비안도넛,NaN,NaN,NaN,서울특별시 강남구 삼성동 114-15번지,서울특별시 강남구 선릉로157길 13-3 1층 (신사동),203421.2131,447368.4963
1,2,언제나커피,NaN,NaN,NaN,서울특별시 강남구 삼성동 143-17번지,서울특별시 강남구 봉은사로 456 지하1층 (삼성동),204373.0834,445796.1888
2,3,카페 그리다(CAFE GRIDA),NaN,NaN,NaN,서울특별시 강남구 청담동 1-19번지,서울특별시 강남구 테헤란로69길 14 103호 (삼성동),204652.0642,445257.8237
3,4,슬리피캣(SLEEPY CAT),NaN,NaN,NaN,서울특별시 강남구 삼성동 159번지,서울특별시 강남구 선릉로 758-2 1층 (청담동),203525.2872,446981.2271
4,5,세븐일레븐 코엑스아셈타워점,NaN,NaN,NaN,서울특별시 강남구 역삼동 642-5번지,서울특별시 강남구 영동대로 517 1층 (삼성동 아셈타워),205283.2321,445960.8509
...,...,...,...,...,...,...,...,...,...
317,318,웨이크업 커피,NaN,NaN,NaN,서울특별시 강남구 신사동 537-8번지,서울특별시 강남구 강남대로96길 9 1층 (역삼동),204673.6614,446141.8297
318,319,가로수 분식,NaN,NaN,NaN,서울특별시 강남구 신사동 550-9번지,서울특별시 강남구 언주로30길 57 (도곡동타워팰리스지하1층),202452.5695,444488.6769
319,320,일젤라또,NaN,NaN,NaN,서울특별시 강남구 자곡동 658번지,서울특별시 강남구 선릉로157길 14-4 지상1층 (신사동),204864.6222,443388.1435
320,321,신전떡볶이 자곡점,NaN,NaN,NaN,서울특별시 강남구 삼성동 70-1번지,서울특별시 강남구 학동로 423 (청담동),203439.8296,447431.3473
321,322,커피인스튜디오,NaN,NaN,NaN,서울특별시 강남구 역삼동 817-11번지,서울특별시 강남구 테헤란로 429 (삼성동지하철2호선 선릉역 구내),204122.3902,446549.8636

In [18]:
list_x = []
list_y = []
for i in range(len(df)):
    x = df.loc[i]['Latitude']
    y = df.loc[i]['longitude']

    x2, y2 = transform(proj_UTMK,proj_WGS84,x,y)
    list_x.append(x2)
    list_y.append(y2)
df['Latitude_x'] = list_x
df['longitude_y'] = list_y

In [23]:
df.to_csv('loc2.csv',encoding='euc-kr', sep=',')

In [3]:
# WGS84 -> UTM-K 샘플
x1, y1 = 127.07098392510115, 35.53895289091983
x2, y2 = transform(proj_WGS84, proj_UTMK, x1, y1)
print(x2,y2)

961114.5197260004 1727112.2691739995

# DataFrame 여러 좌표 변환 Example

In [4]:
# x, y 컬럼을 이용하여 UTM-K좌표를 WGS84로 변환한 Series데이터 반환
def transform_utmk_to_w84(df):
    return pd.Series(transform(proj_UTMK, proj_WGS84, df['x'], df['y']), index=['x', 'y'])

In [5]:
df_xy = pd.DataFrame([
                                        ['A', 961114.519726,1727112.269174],
                                        ['B', 940934.895125,1685175.196487],
                                        ['C', 1087922.228298,1761958.688262]
                                    ], columns=['id', 'x', 'y'])

In [6]:
df_xy

  id             x             y
0  A  9.611145e+05  1.727112e+06
1  B  9.409349e+05  1.685175e+06
2  C  1.087922e+06  1.761959e+06

In [7]:
df_xy[['x_w84', 'y_w84']] = df_xy.apply(transform_utmk_to_w84, axis=1)

In [8]:
df_xy

  id             x             y       x_w84      y_w84
0  A  9.611145e+05  1.727112e+06  127.070984  35.538953
1  B  9.409349e+05  1.685175e+06  126.851387  35.159797
2  C  1.087922e+06  1.761959e+06  128.473791  35.849993